{ "translations": {
    "The Base DN appears to be wrong" : "Base DN خاتادەك قىلىدۇ",
    "Testing configuration…" : "سىناق سەپلىمىسى…",
    "Configuration incorrect" : "سەپلىمىسى خاتا",
    "Configuration incomplete" : "سەپلىمىسى تولۇق ئەمەس",
    "Configuration OK" : "سەپلىمىسى بولىدۇ",
    "Select groups" : "گۇرۇپپىلارنى تاللاڭ",
    "Select object classes" : "ئوبيېكت دەرسلىرىنى تاللاڭ",
    "Please check the credentials, they seem to be wrong." : "كىنىشكىنى تەكشۈرۈپ بېقىڭ ، ئۇلار خاتادەك قىلىدۇ.",
    "Please specify the port, it could not be auto-detected." : "پورتنى بەلگىلىۈڭ ، ئۇنى ئاپتوماتىك بايقىغىلى بولمايدۇ.",
    "Base DN could not be auto-detected, please revise credentials, host and port." : "Base DN نى ئاپتوماتىك بايقىغىلى بولمايدۇ ، كىنىشكا ، باش ئاپپارات ۋە پورتنى تۈزىتىڭ.",
    "Could not detect Base DN, please enter it manually." : "Base DN نى بايقىيالمىدى ، قولدا كىرگۈزۈڭ.",
    "{nthServer}. Server" : "th nthServer}. مۇلازىمېتىر",
    "No object found in the given Base DN. Please revise." : "بېرىلگەن Base DN دا ھېچقانداق نەرسە تېپىلمىدى. قايتا قاراپ بېقىڭ.",
    "More than 1,000 directory entries available." : "1000 دىن ئارتۇق مۇندەرىجە تۈرى بار.",
    " entries available within the provided Base DN" : "تەمىنلەنگەن Base DN نىڭ ئىچىدە",
    "An error occurred. Please check the Base DN, as well as connection settings and credentials." : "خاتالىق كۆرۈلدى. Base DN ، شۇنداقلا ئۇلىنىش تەڭشەكلىرى ۋە كىنىشكىسىنى تەكشۈرۈپ بېقىڭ.",
    "Do you really want to delete the current Server Configuration?" : "نۆۋەتتىكى مۇلازىمېتىر سەپلىمىسىنى ئۆچۈرمەكچىمۇ؟",
    "Confirm Deletion" : "ئۆچۈرۈشنى جەزملەشتۈرۈڭ",
    "Mappings cleared successfully!" : "خەرىتە مۇۋەپپەقىيەتلىك تازىلاندى!",
    "Error while clearing the mappings." : "خەرىتىنى تازىلاش جەريانىدا خاتالىق.",
    "Anonymous bind is not allowed. Please provide a User DN and Password." : "نامسىز باغلاشقا بولمايدۇ. ئىشلەتكۈچى DN ۋە پارول بىلەن تەمىنلەڭ.",
    "LDAP Operations error. Anonymous bind might not be allowed." : "LDAP مەشغۇلات خاتالىقى. نامسىز باغلىنىشقا رۇخسەت قىلىنمايدۇ.",
    "Saving failed. Please make sure the database is in Operation. Reload before continuing." : "تېجەش مەغلۇب بولدى. سانداننىڭ مەشغۇلات قىلىۋاتقانلىقىنى جەزملەشتۈرۈڭ. داۋاملاشتۇرۇشتىن بۇرۇن قايتا يۈكلەڭ.",
    "Switching the mode will enable automatic LDAP queries. Depending on your LDAP size they may take a while. Do you still want to switch the mode?" : "ھالەتنى ئالماشتۇرغاندا ئاپتوماتىك LDAP سوئاللىرىنى قوزغىتىدۇ. LDAP چوڭلۇقىڭىزغا ئاساسەن ئۇلار بىر ئاز ۋاقىت كېتىشى مۇمكىن. سىز يەنىلا ھالەتنى ئالماشتۇرامسىز؟",
    "Mode switch" : "ھالەت ئالماشتۇرۇش",
    "Select attributes" : "خاسلىقنى تاللاڭ",
    "User not found. Please check your login attributes and username. Effective filter (to copy-and-paste for command line validation): <br/>" : "ئىشلەتكۈچى تېپىلمىدى. كىرىش خاسلىقىڭىز ۋە ئىشلەتكۈچى ئىسمىڭىزنى تەكشۈرۈپ بېقىڭ. ئۈنۈملۈك سۈزگۈچ (بۇيرۇق قۇرىنى دەلىللەش ئۈچۈن كۆچۈرۈپ چاپلاش): <br/>",
    "User found and settings verified." : "ئىشلەتكۈچى تېپىلدى ۋە تەڭشەكلەر دەلىللەندى.",
    "Settings verified, but more than one user was found. Only the first will be able to login. Consider a more narrow filter." : "تەڭشەكلەر دەلىللەندى ، ئەمما بىردىن كۆپ ئىشلەتكۈچى تېپىلدى. پەقەت بىرىنچىسىلا كىرەلەيدۇ. تېخىمۇ تار سۈزگۈچنى ئويلىشىپ كۆرۈڭ.",
    "An unspecified error occurred. Please check the settings and the log." : "ئېنىقلانمىغان خاتالىق كۆرۈلدى. تەڭشەك ۋە خاتىرىنى تەكشۈرۈپ بېقىڭ.",
    "The search filter is invalid, probably due to syntax issues like uneven number of opened and closed brackets. Please revise." : "ئىزدەش سۈزگۈچ ئىناۋەتسىز ، بەلكىم ئېچىلغان ۋە يېپىق تىرناقنىڭ تەكشى بولماسلىقى قاتارلىق گرامماتىكىلىق مەسىلىلەر سەۋەبىدىن بولۇشى مۇمكىن. قايتا قاراپ بېقىڭ.",
    "A connection error to LDAP / AD occurred, please check host, port and credentials." : "LDAP / AD غا ئۇلىنىش خاتالىقى كۆرۈلدى ، باش ئاپپارات ، پورت ۋە كىنىشكىنى تەكشۈرۈپ بېقىڭ.",
    "The %uid placeholder is missing. It will be replaced with the login name when querying LDAP / AD." : "% Uid ئورۇن ئىگىسى يوقاپ كەتتى. ئۇ LDAP / AD نى سورىغاندا كىرىش ئىسمى بىلەن ئالماشتۇرۇلىدۇ.",
    "Please provide a login name to test against" : "سىناش ئۈچۈن كىرىش ئىسمى بىلەن تەمىنلەڭ",
    "The group box was disabled, because the LDAP / AD server does not support memberOf." : "گۇرۇپپا قۇتىسى چەكلەنگەن ، چۈنكى LDAP / AD مۇلازىمېتىر ئەزاOf نى قوللىمايدۇ.",
    "Server" : "مۇلازىمېتىر",
    "Users" : "ئىشلەتكۈچىلەر",
    "Login Attributes" : "كىرىش خاسلىقى",
    "Groups" : "گۇرۇپپا",
    "The configuration is invalid: anonymous bind is not allowed." : "سەپلىمىسى ئىناۋەتسىز: نامسىز باغلىنىشقا بولمايدۇ.",
    "The configuration is valid and the connection could be established!" : "سەپلىمىسى ئىناۋەتلىك ، ئۇلىنىش ئورنىتىلسا بولىدۇ!",
    "The configuration is valid, but the Bind failed. Please check the server settings and credentials." : "سەپلىمىسى ئىناۋەتلىك ، ئەمما Bind مەغلۇپ بولدى. مۇلازىمېتىر تەڭشىكى ۋە كىنىشكىسىنى تەكشۈرۈپ بېقىڭ.",
    "The configuration is invalid. Please have a look at the logs for further details." : "سەپلىمىسى ئىناۋەتسىز. تېخىمۇ كۆپ تەپسىلاتلار ئۈچۈن خاتىرىلەرنى كۆرۈپ بېقىڭ.",
    "Failed to delete the server configuration" : "مۇلازىمېتىر سەپلىمىسىنى ئۆچۈرەلمىدى",
    "Failed to clear the mappings." : "خەرىتىنى تازىلاش مەغلۇب بولدى.",
    "No data specified" : "ھېچقانداق سانلىق مەلۇمات كۆرسىتىلمىدى",
    " Could not set configuration %s" : "سەپلىمە% s نى تەڭشىگىلى بولمىدى",
    "Action does not exist" : "ھەرىكەت مەۋجۇت ئەمەس",
    "Could not detect user display name attribute. Please specify it yourself in advanced ldap settings." : "ئىشلەتكۈچى كۆرسىتىش ئىسمى خاسلىقىنى بايقىيالمىدى. ئىلغار ldap تەڭشىكىدە ئۆزىڭىز بەلگىلىۈڭ.",
    "Could not find the desired feature" : "لازىملىق ئىقتىدارنى تاپالمىدى",
    "Test Configuration" : "سىناق سەپلىمىسى",
    "Groups meeting these criteria are available in %s:" : "بۇ ئۆلچەمگە توشىدىغان گۇرۇپپىلار% s دا بار:",
    "Only these object classes:" : "پەقەت بۇ ئوبيېكت دەرسلىرى:",
    "Only from these groups:" : "پەقەت بۇ گۇرۇپپىلاردىن:",
    "Search groups" : "ئىزدەش گۇرۇپپىلىرى",
    "Available groups" : "ئىشلەتكىلى بولىدىغان گۇرۇپپىلار",
    "Selected groups" : "تاللانغان گۇرۇپپىلار",
    "Edit LDAP Query" : "LDAP سوئالنى تەھرىرلەڭ",
    "LDAP Filter:" : "LDAP سۈزگۈچ:",
    "The filter specifies which LDAP groups shall have access to the %s instance." : "سۈزگۈچ قايسى LDAP گۇرۇپپىسىنىڭ% s مىسالىغا ئېرىشەلەيدىغانلىقىنى بەلگىلەيدۇ.",
    "Verify settings and count groups" : "تەڭشەكلەرنى تەكشۈرۈپ گۇرۇپپىلارنى ساناش",
    "When logging in, %s will find the user based on the following attributes:" : "تىزىمغا كىرگەندە ،% s تۆۋەندىكى خاسلىقلارغا ئاساسەن ئىشلەتكۈچىنى تاپىدۇ:",
    "LDAP / AD Username:" : "LDAP / AD ئىشلەتكۈچى ئىسمى:",
    "Allows login against the LDAP / AD username, which is either uid or samaccountname and will be detected." : "LDAP / AD ئىشلەتكۈچى نامىغا كىرىشكە يول قويىدۇ ، بۇ uid ياكى samaccountname بولۇپ ، بايقايدۇ.",
    "LDAP / AD Email Address:" : "LDAP / AD ئېلېكترونلۇق خەت ئادرېسى:",
    "Allows login against an email attribute. Mail and mailPrimaryAddress will be allowed. WARNING: Disabling login with email might require enabling strict login checking to be effective, please refer to ownCloud documentation for more details!" : "ئېلېكترونلۇق خەت خاسلىقىغا قارشى كىرىشكە يول قويىدۇ. خەت ۋە پوچتا يوللانمىسى ئادرېسىغا رۇخسەت قىلىنىدۇ. ئاگاھلاندۇرۇش: ئېلېكترونلۇق خەت ئارقىلىق كىرىشنى چەكلەشتە قاتتىق كىرىشنى تەكشۈرۈشنىڭ ئۈنۈملۈك بولۇشى تەلەپ قىلىنىشى مۇمكىن ، تېخىمۇ كۆپ تەپسىلاتلار ئۈچۈن ئۆزىڭىزنىڭ Cloud ھۆججىتىنى كۆرۈڭ.",
    "Other Attributes:" : "باشقا خاسلىقى:",
    "Defines the filter to apply, when login is attempted. %%uid replaces the username in the login action. Example: \"uid=%%uid\"" : "كىرىشكە ئۇرۇنغاندا سۈزگۈچنى بەلگىلەيدۇ. %% uid كىرىش ھەرىكىتىدىكى ئىشلەتكۈچى نامىنىڭ ئورنىنى ئالىدۇ. مىسال: \"uid = %% uid\"",
    "Test Loginname" : "سىناق خاتىرىسى",
    "Verify settings" : "تەڭشەكلەرنى دەلىللەڭ",
    "1. Server" : "1. مۇلازىمېتىر",
    "%s. Server:" : "% s. مۇلازىمېتىر:",
    "Add a new and blank configuration" : "يېڭى ۋە قۇرۇق سەپلىمىنى قوشۇڭ",
    "Copy current configuration into new directory binding" : "نۆۋەتتىكى سەپلىمىنى يېڭى مۇندەرىجە باغلاشقا كۆچۈرۈڭ",
    "Delete the current configuration" : "نۆۋەتتىكى سەپلىمىنى ئۆچۈرۈڭ",
    "Host" : "باش ئاپپارات",
    "Port" : "ئېغىز",
    "You can omit the protocol, except you require SSL. Then start with ldaps://" : "سىز SSL نى تەلەپ قىلغاندىن باشقا ، كېلىشىمنى ئەمەلدىن قالدۇرالايسىز. ئاندىن ldaps دىن باشلاڭ: //",
    "Use StartTLS support" : "StartTLS قوللاشنى ئىشلىتىڭ",
    "Enable StartTLS support (also known as LDAP over TLS) for the connection.  Note that this is different than LDAPS (LDAP over SSL) which doesn't need this checkbox checked. You'll need to import the LDAP server's certificate in your %s server." : "ئۇلىنىش ئۈچۈن StartTLS قوللاشنى قوزغىتىڭ (TLS ئۈستىدىكى LDAP دەپمۇ ئاتىلىدۇ).  شۇنىڭغا دىققەت قىلىڭكى ، بۇ LDAPS (SSL ئۈستىدىكى LDAP) بىلەن ئوخشىمايدۇ ، بۇ تەكشۈرۈش رامكىسى تەكشۈرۈلمەيدۇ. LDAP مۇلازىمېتىرنىڭ گۇۋاھنامىسىنى% s مۇلازىمېتىرىڭىزغا ئەكىرىشىڭىز كېرەك.",
    "User DN" : "ئىشلەتكۈچى DN",
    "The DN of the client user with which the bind shall be done, e.g. uid=agent,dc=example,dc=com. For anonymous access, leave DN and Password empty." : "باغلىنىشلىق ئېلىپ بېرىلىدىغان خېرىدار ئىشلەتكۈچىنىڭ DN ، مەسىلەن. uid = ۋاكالەتچى ، dc = مىسال ، dc = com. نامسىز زىيارەت قىلىش ئۈچۈن DN ۋە پارولنى بوش قويۇڭ.",
    "Password" : "ئىم",
    "For anonymous access, leave DN and Password empty." : "نامسىز زىيارەت قىلىش ئۈچۈن DN ۋە پارولنى بوش قويۇڭ.",
    "One Base DN per line" : "ھەر بىر قۇر DN",
    "You can specify Base DN for users and groups in the Advanced tab" : "ئالىي بەتكۈچتىكى ئىشلەتكۈچى ۋە گۇرۇپپىلار ئۈچۈن Base DN نى بەلگىلىيەلەيسىز",
    "Detect Base DN" : "Base DN نى ئېنىقلاڭ",
    "Test Base DN" : "سىناق ئاساسى DN",
    "Manually enter LDAP filters (recommended for large directories)" : "LDAP سۈزگۈچنى قولدا كىرگۈزۈڭ (چوڭ مۇندەرىجە تەۋسىيە قىلىنىدۇ)",
    "Avoids automatic LDAP requests. Better for bigger setups, but requires some LDAP knowledge." : "ئاپتوماتىك LDAP تەلىپىدىن ساقلىنىدۇ. چوڭراق تەڭشەش ئۈچۈن ياخشى ، ئەمما بىر قىسىم LDAP بىلىملىرىنى تەلەپ قىلىدۇ.",
    "%s access is limited to users meeting these criteria:" : "% s زىيارەت قىلىش بۇ ئۆلچەمگە توشىدىغان ئابونتلار بىلەنلا چەكلىنىدۇ:",
    "The most common object classes for users are organizationalPerson, person, user, and inetOrgPerson. If you are not sure which object class to select, please consult your directory admin." : "ئىشلەتكۈچىلەر ئۈچۈن ئەڭ كۆپ ئۇچرايدىغان ئوبيېكت سىنىپلىرى تەشكىلىي شەخس ، ئادەم ، ئىشلەتكۈچى ۋە inetOrgPerson. قايسى ئوبيېكت سىنىپىنى تاللاشنى بىلمىسىڭىز مۇندەرىجە باشقۇرغۇچىڭىز بىلەن مەسلىھەتلىشىڭ.",
    "The filter specifies which LDAP users shall have access to the %s instance." : "سۈزگۈچ قايسى LDAP ئىشلەتكۈچىلەرنىڭ% s مىسالىغا ئېرىشەلەيدىغانلىقىنى بەلگىلەيدۇ.",
    "Verify settings and count users" : "تەڭشەكلەرنى تەكشۈرۈپ ، ئىشلەتكۈچىنى ساناپ بېقىڭ",
    "Back" : "قايتىش",
    "Continue" : "داۋاملاشتۇر",
    "LDAP" : "LDAP",
    "Advanced" : "ئالىي",
    "Expert" : "مۇتەخەسسىس",
    "Help" : "ياردەم",
    "Saving" : "تېجەش",
    "Saved" : "ساقلاندى",
    "<b>Warning:</b> Apps user_ldap and user_webdavauth are incompatible. You may experience unexpected behavior. Please ask your system administrator to disable one of them." : "<b> ئاگاھلاندۇرۇش: </b> ئەپلەر user_ldap ۋە user_webdavauth ماس كەلمەيدۇ. ئويلىمىغان ھەرىكەتلەرنى باشتىن كەچۈرۈشىڭىز مۇمكىن. سىستېما باشقۇرغۇچىڭىزدىن ئۇلارنىڭ بىرىنى چەكلىشىنى تەلەپ قىلىڭ.",
    "<b>Warning:</b> The PHP LDAP module is not installed, the backend will not work. Please ask your system administrator to install it." : "<b> ئاگاھلاندۇرۇش: </b> PHP LDAP مودۇلى ئورنىتىلمىدى ، ئارقا تەرىپى ئىشلىمەيدۇ. ئۇنى قاچىلاشنى سىستېما باشقۇرغۇچىڭىزدىن سوراڭ.",
    "Connection Settings" : "باغلىنىش تەڭشىكى",
    "When unchecked, this configuration will be skipped." : "تەكشۈرۈلمىسە ، بۇ سەپلىمە ئاتلاپ كېتىدۇ.",
    "Configuration Active" : "سەپلىمە ئاكتىپ",
    "Backup (Replica) Host" : "زاپاسلاش (Replica) رىياسەتچىسى",
    "Give an optional backup host. It must be a replica of the main LDAP/AD server." : "ئىختىيارى زاپاسلاش مۇلازىمىتىرى بېرىڭ. ئۇ چوقۇم ئاساسلىق LDAP / AD مۇلازىمېتىرنىڭ كۆپەيتىلگەن نۇسخىسى بولۇشى كېرەك.",
    "Backup (Replica) Port" : "زاپاسلاش (Replica) ئېغىزى",
    "Disable Main Server" : "ئاساسلىق مۇلازىمېتىرنى چەكلەڭ",
    "Only connect to the replica server." : "پەقەت كۆپەيتىلگەن مۇلازىمېتىرغا ئۇلاڭ.",
    "Turn off SSL certificate validation." : "SSL گۇۋاھنامىسىنى دەلىللەشنى ئېتىۋېتىڭ.",
    "Not recommended, use it for testing only! If connection only works with this option, import the LDAP server's SSL certificate in your %s server." : "تەۋسىيە قىلىنمايدۇ ، ئۇنى پەقەت سىناق ئۈچۈن ئىشلىتىڭ! ئەگەر ئۇلىنىش پەقەت مۇشۇ تاللاش بىلەنلا ئىشلەيدىغان بولسا ،% s مۇلازىمېتىرىڭىزغا LDAP مۇلازىمېتىرنىڭ SSL گۇۋاھنامىسىنى ئەكىرىڭ.",
    "Cache Time-To-Live" : "Cache Time-To-Live",
    "in seconds. A change empties the cache." : "سېكۇنتتا. ئۆزگەرتىش غەملەكنى بوشاتتى.",
    "Network Timeout" : "تور ۋاقتى",
    "timeout for all the ldap network operations, in seconds." : "بارلىق ldap تور مەشغۇلاتىنىڭ ۋاقتى ، سېكۇنتتا.",
    "Directory Settings" : "مۇندەرىجە تەڭشىكى",
    "User Display Name Field" : "ئىشلەتكۈچى كۆرسىتىش ئىسمى",
    "The LDAP attribute to use to generate the user's display name." : "LDAP خاسلىقى ئىشلەتكۈچىنىڭ كۆرسىتىش نامىنى ھاسىل قىلىشقا ئىشلىتىلىدۇ.",
    "2nd User Display Name Field" : "2-ئىشلەتكۈچى كۆرسىتىش ئىسمى مەيدانى",
    "Optional. An LDAP attribute to be added to the display name in brackets. Results in e.g. »John Doe (john.doe@example.org)«." : "ئىختىيارىي. تىرناق ئىچىدىكى كۆرسىتىش نامىغا قوشۇلىدىغان LDAP خاسلىقى. مەسىلەن: »جون دو (john.doe@example.org)«.",
    "Base User Tree" : "ئاساسى ئىشلەتكۈچى دەرىخى",
    "One User Base DN per line" : "ھەر بىر قۇردا بىر ئىشلەتكۈچى ئاساسى DN",
    "User Search Attributes" : "ئىشلەتكۈچى ئىزدەش خاسلىقى",
    "Optional; one attribute per line" : "ئىختىيارىي ھەر بىر قۇرغا بىر خاسلىق",
    "Each attribute value is truncated to 191 characters" : "ھەر بىر خاسلىق قىممىتى 191 ھەرپكە قىسقارتىلدى",
    "Group Display Name Field" : "گۇرۇپپا كۆرسىتىش ئىسمى مەيدانى",
    "The LDAP attribute to use to generate the groups's display name." : "LDAP خاسلىقى گۇرۇپپىلارنىڭ كۆرسىتىش نامىنى ھاسىل قىلىشقا ئىشلىتىلىدۇ.",
    "Base Group Tree" : "ئاساسى گۇرۇپپا دەرىخى",
    "One Group Base DN per line" : "ھەر بىر قۇر بىر گۇرۇپپا ئاساسى DN",
    "Group Search Attributes" : "گۇرۇپپا ئىزدەش خاسلىقى",
    "Group-Member association" : "گۇرۇپپا-ئەزالار جەمئىيىتى",
    "Group-Member algorithm" : "گۇرۇپپا ئەزالىرىنىڭ ھېسابلاش ئۇسۇلى",
    "Algorithm to be used when searching for members in a group. In case of doubt, \"%s\" is the safe choice. Note that you're responsible of fulfilling the restrictions in order to use any algorithm; the app will behave erratically if the restrictions aren't fulfilled" : "گۇرۇپپىدىكى ئەزالارنى ئىزدىگەندە ئىشلىتىلىدىغان ئالگورىزىم. گۇمانلىق ئەھۋال ئاستىدا ، «% s» بىخەتەر تاللاش. ھەر قانداق ئالگورىزىمنى ئىشلىتىش ئۈچۈن چەكلىمىلەرنى ئورۇنداشقا مەسئۇل ئىكەنلىكىڭىزگە دىققەت قىلىڭ. ئەگەر چەكلىمىلەر ئەمەلگە ئاشمىسا ، ئەپ قالايمىقان ھەرىكەت قىلىدۇ",
    "Scan the group looking for users. This is the basic method and works without restrictions. It supports nested groups" : "ئىشلەتكۈچى ئىزدەۋاتقان گۇرۇپپىنى سايىلەڭ. بۇ ئاساسىي ئۇسۇل بولۇپ ، چەكلىمىسىز ئىشلەيدۇ. ئۇلانغان گۇرۇپپىلارنى قوللايدۇ",
    "Search the members using the \"memberOf\" attribute. It requires support for the \"memberOf\" attribute, and it doesn't work with nested groups" : "ئەزالارنى «memberOf» خاسلىقى ئارقىلىق ئىزدەڭ. ئۇ «memberOf» خاسلىقىنى قوللاشنى تەلەپ قىلىدۇ ، ئۇ ئۇلانغان گۇرۇپپىلار بىلەن ئىشلىمەيدۇ",
    "Search the members using the \"memberOf\" attribute in a recursive way. It requires support for the \"memberOf\" attribute and support for the \"LDAP_MATCHING_RULE_IN_CHAIN\" operator, it works with nested groups. Its main target is AD servers. NOTE: This algorithm only works with members explicitly listed in the group; AD's primary group, for example, won't be taken into account." : "ئەزالارنى قايتا-قايتا «memberOf» خاسلىقى ئارقىلىق ئىزدەڭ. ئۇ «memberOf» خاسلىقىنى قوللاش ۋە «LDAP_MATCHING_RULE_IN_CHAIN» مەشغۇلاتچىسىنى قوللاشنى تەلەپ قىلىدۇ ، ئۇ ئۇۋىغان گۇرۇپپىلار بىلەن ئىشلەيدۇ. ئۇنىڭ ئاساسلىق نىشانى AD مۇلازىمېتىرلىرى. ئەسكەرتىش: بۇ ھېسابلاش ئۇسۇلى پەقەت گۇرۇپپىدا ئېنىق كۆرسىتىلگەن ئەزالار بىلەنلا ئىشلەيدۇ. مەسىلەن AD نىڭ دەسلەپكى گۇرۇپپىسى نەزەرگە ئېلىنمايدۇ.",
    "Dynamic Group Member URL" : "ھەرىكەتچان گۇرۇپپا ئەزالىرىنىڭ ئادرېسى",
    "The LDAP attribute that on group objects contains an LDAP search URL that determines what objects belong to the group. (An empty setting disables dynamic group membership functionality.)" : "گۇرۇپپا ئوبيېكتلىرىدىكى LDAP خاسلىقى LDAP ئىزدەش URL نى ئۆز ئىچىگە ئالغان بولۇپ ، قايسى ئوبيېكتلارنىڭ گۇرۇپپىغا تەۋە ئىكەنلىكىنى بەلگىلەيدۇ. (قۇرۇق تەڭشەك ھەرىكەتچان گۇرۇپپا ئەزالىق ئىقتىدارىنى چەكلەيدۇ.)",
    "Nested Groups" : "توپلانغان گۇرۇپپىلار",
    "When switched on, groups that contain groups are supported. (Only works if the group member attribute contains DNs.)" : "ئاچقاندا گۇرۇپپىلارنى ئۆز ئىچىگە ئالغان گۇرۇپپىلارنى قوللايدۇ. (پەقەت گۇرۇپپا ئەزالىرىنىڭ خاسلىقى DNs بولغاندىلا ئىشلەيدۇ.)",
    "Paging chunksize" : "Paging chunksize",
    "Chunksize used for paged LDAP searches that may return bulky results like user or group enumeration. (Setting it 0 disables paged LDAP searches in those situations.)" : "Chunksize تور بەت LDAP ئىزدەش ئۈچۈن ئىشلىتىلىدۇ ، بۇ ئىشلەتكۈچى ياكى گۇرۇپپا تىزىملاش قاتارلىق چوڭ نەتىجىلەرنى قايتۇرىدۇ. (ئۇنى 0 قىلىپ تەڭشەش بۇ خىل ئەھۋال ئاستىدا LDAP ئىزدەشنى چەكلەيدۇ.)",
    "Special Attributes" : "ئالاھىدە خاسلىق",
    "Quota Field" : "Quota Field",
    "Leave empty for user's default quota. Otherwise, specify an LDAP/AD attribute." : "ئىشلەتكۈچىنىڭ سۈكۈتتىكى نورمىسى ئۈچۈن بوش قويۇڭ. بولمىسا ، LDAP / AD خاسلىقىنى بەلگىلەڭ.",
    "Quota Default" : "Quota Default",
    "Override default quota for LDAP users who do not have a quota set in the Quota Field." : "نورما ئۆلچىمىدە نورما بېكىتىلمىگەن LDAP ئىشلەتكۈچىلىرىنىڭ سۈكۈتتىكى نورمىسىنى قاپلىۋېتىڭ.",
    "Email Field" : "ئېلېكترونلۇق خەت مەيدانى",
    "Set the user's email from their LDAP attribute. Leave it empty for default behaviour." : "ئىشلەتكۈچىنىڭ ئېلېكترونلۇق خەتلىرىنى LDAP خاسلىقىدىن تەڭشەڭ. سۈكۈتتىكى ھەرىكەت ئۈچۈن ئۇنى بوش قويۇڭ.",
    "User Home Folder Naming Rule" : "ئىشلەتكۈچى ئائىلە ھۆججەت قىسقۇچىغا ئىسىم قويۇش قائىدىسى",
    "Leave empty for user name (default). Otherwise, specify an LDAP/AD attribute." : "ئىشلەتكۈچى نامىغا قۇرۇق قويۇڭ (سۈكۈتتىكى). بولمىسا ، LDAP / AD خاسلىقىنى بەلگىلەڭ.",
    "Exposed User Attributes" : "ئاشكارىلانغان ئىشلەتكۈچى خاسلىقى",
    "User attributes that other apps will be able to check" : "باشقا ئەپلەر تەكشۈرەلەيدىغان ئىشلەتكۈچى خاسلىقى",
    "Internal Username" : "ئىچكى ئىشلەتكۈچى ئىسمى",
    "By default the internal username will be created from the UUID attribute. It makes sure that the username is unique and characters do not need to be converted. The internal username has the restriction that only these characters are allowed: [ a-zA-Z0-9+_.@- ].  Other characters are replaced with their ASCII correspondence or simply omitted. On collisions a number will be added/increased. The internal username is used to identify a user internally. It is also the default name for the user home folder. It is also a part of remote URLs, for instance for all *DAV services. With this setting, the default behavior can be overridden. To do so, enter the user display name attribute in the following field. Leave it empty for default behavior. Changes will have effect only on newly mapped (added) LDAP users." : "سۈكۈتتىكى ھالەتتە ئىشلەتكۈچى ئىسمى UUID خاسلىقىدىن قۇرۇلىدۇ. ئىشلەتكۈچى نامىنىڭ ئۆزگىچە ئىكەنلىكى ۋە ھەرپلەرنى ئۆزگەرتىشنىڭ ھاجىتى يوقلىقىغا كاپالەتلىك قىلىدۇ. ئىچكى ئىشلەتكۈچى نامىدا پەقەت بۇ ھەرپلەرلا رۇخسەت قىلىنغان چەكلىمە بار: [a-zA-Z0-9 + _. @ -].  باشقا ھەرپلەر ئۇلارنىڭ ASCII خەت ئالاقىسى بىلەن ئالماشتۇرۇلىدۇ ياكى ئاددىيلا چىقىرىۋېتىلىدۇ. سوقۇلغاندا بىر سان قوشۇلىدۇ / كۆپەيتىلىدۇ. ئىچكى ئىشلەتكۈچى ئىسمى ئىچكى ئىشلەتكۈچىنى پەرقلەندۈرۈش ئۈچۈن ئىشلىتىلىدۇ. ئۇ يەنە ئىشلەتكۈچىنىڭ ئائىلە قىسقۇچىنىڭ سۈكۈتتىكى ئىسمى. ئۇ يىراقتىكى URL لارنىڭ بىر قىسمى ، مەسىلەن بارلىق * DAV مۇلازىمىتى ئۈچۈن. بۇ تەڭشەك ئارقىلىق سۈكۈتتىكى ھەرىكەتنى بېسىپ ئۆتكىلى بولىدۇ. شۇنداق قىلىش ئۈچۈن ، تۆۋەندىكى ساھەگە ئىشلەتكۈچى كۆرسىتىش ئىسمى خاسلىقىنى كىرگۈزۈڭ. سۈكۈتتىكى ھەرىكەت ئۈچۈن ئۇنى بوش قويۇڭ. ئۆزگەرتىش پەقەت يېڭى سىزىلغان (قوشۇلغان) LDAP ئىشلەتكۈچىلەرگىلا تەسىر كۆرسىتىدۇ.",
    "Internal Username Attribute:" : "ئىچكى ئىشلەتكۈچى ئىسمى خاسلىقى:",
    "Internal Groupname" : "ئىچكى گۇرۇپپا ئىسمى",
    "The internal groupname is used to uniquely identify the group. It has the same restrictions as the internal username, in particular, the group name must be immutable and unique. By default, the UUID will be used. This internal groupname won't likely by visible because a displayname attribute is intended to be used to show the group." : "ئىچكى گۇرۇپپا ئىسمى گۇرۇپپىنى ئالاھىدە پەرقلەندۈرۈش ئۈچۈن ئىشلىتىلىدۇ. ئۇنىڭ ئىچكى ئىشلەتكۈچى ئىسمى بىلەن ئوخشاش چەكلىمىسى بار ، بولۇپمۇ گۇرۇپپا ئىسمى ئۆزگەرمەس ۋە ئۆزگىچە بولۇشى كېرەك. سۈكۈت بويىچە ، UUID ئىشلىتىلىدۇ. بۇ ئىچكى گۇرۇپپا ئىسمى كۆرۈنمەسلىكى مۇمكىن ، چۈنكى كۆرسىتىش خاسلىقى گۇرۇپپىنى كۆرسىتىش ئۈچۈن ئىشلىتىلىدۇ.",
    "Internal Groupname Attribute:" : "ئىچكى گۇرۇپپا ئىسمى:",
    "Override UUID detection" : "UUID بايقاشنى قاپلىۋېتىڭ",
    "By default, the UUID attribute is automatically detected. The UUID attribute is used to doubtlessly identify LDAP users and groups. Also, the internal username will be created based on the UUID, if not specified otherwise above. You can override the setting and pass an attribute of your choice. You must make sure that the attribute of your choice can be fetched for both users and groups and it is unique. Leave it empty for default behavior. Changes will have effect only on newly mapped (added) LDAP users and groups." : "سۈكۈت بويىچە ، UUID خاسلىقى ئاپتوماتىك بايقىلىدۇ. UUID خاسلىقى LDAP ئىشلەتكۈچىلىرى ۋە گۇرۇپپىلىرىنى شەكسىز پەرقلەندۈرۈش ئۈچۈن ئىشلىتىلىدۇ. ئۇندىن باشقا ، ئىچكى ئىشلەتكۈچى ئىسمى UUID ئاساسىدا قۇرۇلىدۇ ، ئەگەر يۇقىرىدا ئېنىق بەلگىلەنمىگەن بولسا. تەڭشەكنى بېسىپ ئۆتۈپ ، ئۆزىڭىز تاللىغان خاسلىقنى يەتكۈزەلەيسىز. سىز ئۆزىڭىز تاللىغان خاسلىقنىڭ ئىشلەتكۈچىلەر ۋە گۇرۇپپىلار ئۈچۈن ئېلىپ كېلىنەلەيدىغانلىقىغا كاپالەتلىك قىلىشىڭىز كېرەك. سۈكۈتتىكى ھەرىكەت ئۈچۈن ئۇنى بوش قويۇڭ. ئۆزگەرتىش پەقەت يېڭى سىزىلغان (قوشۇلغان) LDAP ئىشلەتكۈچىلىرى ۋە گۇرۇپپىلىرىغىلا تەسىر كۆرسىتىدۇ.",
    "UUID Attribute for Users:" : "ئىشلەتكۈچىلەر ئۈچۈن UUID خاسلىقى:",
    "UUID Attribute for Groups:" : "گۇرۇپپىلارغا UUID خاسلىقى:",
    "Username-LDAP User Mapping" : "ئىشلەتكۈچى ئىسمى-LDAP ئىشلەتكۈچى خەرىتىسى",
    "Usernames are used to store and assign (meta) data. In order to precisely identify and recognize users, each LDAP user will have an internal username. This requires a mapping from username to LDAP user. The created username is mapped to the UUID of the LDAP user. Additionally the DN is cached as well to reduce LDAP interaction, but it is not used for identification. If the DN changes, the changes will be found. The internal username is used all over. Clearing the mappings will have leftovers everywhere. Clearing the mappings is not configuration sensitive, it affects all LDAP configurations! Never clear the mappings in a production environment, only in a testing or experimental stage." : "ئىشلەتكۈچى ئىسمى سانلىق مەلۇماتنى ساقلاش ۋە تەقسىملەشتە ئىشلىتىلىدۇ. ئىشلەتكۈچىلەرنى ئېنىق تونۇش ۋە تونۇش ئۈچۈن ، ھەر بىر LDAP ئىشلەتكۈچىنىڭ ئىچكى ئىشلەتكۈچى ئىسمى بولىدۇ. بۇ ئىشلەتكۈچى نامىدىن LDAP ئىشلەتكۈچىگە خەرىتە سىزىشنى تەلەپ قىلىدۇ. قۇرۇلغان ئىشلەتكۈچى ئىسمى LDAP ئىشلەتكۈچىنىڭ UUID غا سىزىلغان. بۇنىڭدىن باشقا ، DN غەملەك بىلەن LDAP ئۆز-ئارا تەسىرنى ئازايتىدۇ ، ئەمما ئۇ پەرقلەندۈرۈشكە ئىشلىتىلمەيدۇ. ئەگەر DN ئۆزگەرسە ، ئۆزگىرىشلەر تېپىلىدۇ. ئىچكى ئىشلەتكۈچى ئىسمى ھەممە يەردە ئىشلىتىلىدۇ. خەرىتىنى تازىلاش ھەممە يەردە ئېشىپ قالىدۇ. خەرىتىنى تازىلاش سەپلىمىگە سەزگۈر ئەمەس ، ئۇ بارلىق LDAP سەپلىمىسىگە تەسىر كۆرسىتىدۇ! خەرىتىنى ئىشلەپچىقىرىش مۇھىتىدا ھەرگىز تازىلىماڭ ، پەقەت سىناق ياكى تەجرىبە باسقۇچىدىلا.",
    "Clear Username-LDAP User Mapping" : "ئىشلەتكۈچى ئىسمى- LDAP ئىشلەتكۈچى خەرىتىسىنى تازىلاڭ",
    "Clear Groupname-LDAP Group Mapping" : "گۇرۇپپا ئىسمى- LDAP گۇرۇپپا خەرىتىسىنى تازىلاش"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}